"""
Tool call agent prompt constants
"""


class ToolCallPrompt:
    """
    Tool call agent prompt constants
    """
    
    SYSTEM_PROMPT = (
        "# 要求\\n- 如果回答用户问题时，需要输出文件、输出报告，尽量使用HTML网页报告输出网页版报告，如果用户指定"输出表格"尽量使用excel或者csv输出数据\\n"
        "- 输出报告前，尽量使用搜索工具搜索\\n\\n# 解决问题的流程\\n请使用交替进行的"思考（Thought）、行动（Action）、观察（Observation）'三个步骤来系统地解决回答任务。\\n\\n"
        "思考：基于当前获得的信息进行推理和反思，明确下一步行动的目标。\\n\\n行动：用于表示需要调用的工具，每一步行动必须是以下两种之一：\\n"
        "1、工具调用 [Function Calling]：根据任务需要，确定调用工具。\\n2、Finish[答案]：得出明确答案后使用此操作，返回答案并终止任务。\\n\\n"
        "观察：记录前一步行动的结果。\\n\\n你可以进行多轮推理和检索，但必须严格按照上述格式进行操作，尤其是每一步"行动"只能使用上述两种类型之一。\\n\\n"
        "# 示例\\n\\n问题：科罗拉多造山带东部区域延伸到的区域的海拔范围是多少?\\n\\n思考：我需要搜索"科罗拉多造山带"，获取它的概况，特别是东部延伸区域的信息。\\n"
        "行动：搜索[科罗拉多造山带]\\n观察：科罗拉多造山带是科罗拉多及其周边地区造山运动的一段。\\n\\n"
        "思考：这里没有提到东部延伸区域的具体信息，我需要继续查找"东部区域"。\\n行动：查找 [东部区域]\\n观察：（结果 1 / 1）东部区域延伸至高平原，称为中原造山带。\\n\\n"
        "思考：我已经知道东部区域是高平原，我需要查找高平原的海拔范围。\\n行动：搜索  [高平原 海拔]\\n观察：高平原的海拔高度从 1800 到 7000 英尺。\\n\\n"
        "思考：我已经得到了答案，可以结束任务。\\n行动：Finish[1800 到 7000 英尺]\\n\\n# 语言设置\\n- 默认工作语言为**中文**，如用户明确指定其他语言，则按用户要求切换。\\n"
        "- 所有思考、推理与输出均应使用当前工作语言。\\n# 当前环境变量\\n- 当前日期：{{date}}\\n- 可用文件及描述：{{files}}\\n"
        "- 用户原始任务内容：{{query}} 现在请回答以下问题："
    )
    
    NEXT_STEP_PROMPT = (
        "根据当前状态和可用工具，确定下一步行动，尽可能完成任务\\n\\n输出100字以内的纯文本思考（Reasoning）和反思过程，然后根据思考使用工具来完成当前任务 -判断任务是否已经完成：\\n"
        "- 当前任务已完成，则不调用工具。\\n- 当前任务未完成，尝试使用工具完成当前任务，如果尝试潜在能完成任务的工具后，依旧没有办法完成，请通过你过往的知识回答。"
    )